app/controllers/gists_controller.rb

SELECT  "gists".* FROM "gists"  WHERE (lang LIKE '%c%')  ORDER BY created_at DESC LIMIT 8 OFFSET 0
SELECT COUNT(*) FROM "gists"  WHERE (lang LIKE '%abap%')
---
  def index
      @gists = Gist.search(params[:search]).paginate(page: params[:page], per_page: 8).order('created_at DESC')

UPDATE "gists" SET "snippet" = ?, "updated_at" = ? WHERE "gists"."id" = 1  [["snippet", "#include <stdio.h>\r\n \r\nint main(void)\r\n{\r\n    printf(\"Hello, world test!\\n\");\r\n    return 0;\r\n}"], ["updated_at", "2014-03-26 16:54:19.331859"]]
---
  def update
    respond_to do |format|
      if @gist.update(gist_params)